# Relatório de Análise V

## Tratamento de dados faltantes

In [34]:
import pandas as pd

In [35]:
dados = pd.read_csv('dados/aluguel_residencial.csv', sep = ';')
dados.head(10)

,Unnamed: 0,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU
0,0,Quitinete,Copacabana,1,0,0,40,1700.0,500.0,60.0
1,1,Casa,Jardim Botânico,2,0,1,100,7000.0,NaN,NaN
2,2,Apartamento,Centro,1,0,0,15,800.0,390.0,20.0
3,3,Apartamento,Higienópolis,1,0,0,48,800.0,230.0,NaN
4,4,Apartamento,Vista Alegre,3,1,0,70,1200.0,NaN,NaN
5,5,Apartamento,Cachambi,2,0,0,50,1300.0,301.0,17.0
6,6,Casa de Condomínio,Barra da Tijuca,5,4,5,750,22000.0,NaN,NaN
7,7,Casa de Condomínio,Ramos,2,2,0,65,1000.0,NaN,NaN
8,8,Apartamento,Centro,1,0,0,36,1200.0,NaN,NaN
9,9,Apartamento,Grajaú,2,1,0,70,1500.0,642.0,74.0

In [36]:
dados.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 22580 entries, 0 to 22579
Data columns (total 10 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  22580 non-null  int64
 1   Tipo        22580 non-null  object
 2   Bairro      22580 non-null  object
 3   Quartos     22580 non-null  int64
 4   Vagas       22580 non-null  int64
 5   Suites      22580 non-null  int64
 6   Area        22580 non-null  int64
 7   Valor       22571 non-null  float64
 8   Condominio  20765 non-null  float64
 9   IPTU        15795 non-null  float64
dtypes: float64(3), int64(5), object(2)
memory usage: 1.7+ MB

### Obs: Nota-se que as colunas Valor, Condominio e IPTU tem valores nulos, então devemos trata-los

### - Coluna Valor

In [37]:
#registros da tabela Valor que tem registro nulo
dados[dados['Valor'].isnull()]

,Unnamed: 0,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU
58,58,Apartamento,Barra da Tijuca,2,1,1,70,NaN,970.0,68.0
1492,1492,Apartamento,Leme,2,0,0,75,NaN,878.0,NaN
1683,1683,Casa,Campo Grande,3,4,3,363,NaN,NaN,NaN
2012,2012,Apartamento,Botafogo,2,0,0,95,NaN,1010.0,170.0
2034,2034,Apartamento,Copacabana,2,0,0,72,NaN,850.0,NaN
4941,4941,Casa,Campo Grande,3,2,1,100,NaN,NaN,NaN
8568,8568,Apartamento,Leme,2,0,1,75,NaN,878.0,NaN
8947,8947,Apartamento,Glória,3,0,1,135,NaN,910.0,228.0
9149,9149,Apartamento,Gávea,3,1,1,105,NaN,880.0,221.0

In [38]:
#não nos interessa imóveis que não tem o Valor preenchido

#para eliminar dados

A = dados.shape[0]
dados.dropna(subset=['Valor'], inplace=True)
B = dados.shape[0]
A - B

9

### - Coluna Condomínio e IPTU

In [39]:
dados[dados['Condominio'].isnull()].shape[0]

1813

In [40]:
#não nos interessa imóveis que são apartamentos e não tem o valor do condominio preenchido

#para eliminar dados

selecao = (dados['Tipo']== 'Apartamento') & (dados['Condominio'].isnull())
selecao

0        False
1        False
2        False
3        False
4         True
         ...
22575    False
22576    False
22577    False
22578    False
22579    False
Length: 22571, dtype: bool

In [41]:
#para eliminar dados
A = dados.shape[0]
dados = dados[~selecao]     # o ~ faz a negação
B = dados.shape[0]
A - B

745

In [42]:
dados[dados['Condominio'].isnull()].shape[0]

1068

In [43]:
#preenche com 0 todos os valores nulos
dados = dados.fillna(0)
#ou usa dados = dados.fillna({'Condominio': 0, 'IPTU': 0})

In [49]:
dados.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 21826 entries, 0 to 22579
Data columns (total 10 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  21826 non-null  int64
 1   Tipo        21826 non-null  object
 2   Bairro      21826 non-null  object
 3   Quartos     21826 non-null  int64
 4   Vagas       21826 non-null  int64
 5   Suites      21826 non-null  int64
 6   Area        21826 non-null  int64
 7   Valor       21826 non-null  float64
 8   Condominio  21826 non-null  float64
 9   IPTU        21826 non-null  float64
dtypes: float64(3), int64(5), object(2)
memory usage: 1.8+ MB

## Substituição do arquivo com o DataFrame atualizado

In [51]:
dados.to_csv('dados/aluguel_residencial.csv', sep = ';', index=False)